Revit 2026 API

# NoiseTextureRealWorldOffsetZ Property

---

The property labeled "Offset Z" from the "Noise" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string TextureRealWorldOffsetZ { get; }
```
```vb
Public Shared ReadOnly Property TextureRealWorldOffsetZ As String
	Get
```
```cpp
public:
static property String^ TextureRealWorldOffsetZ {
	String^ get ();
}
```
```fsharp
static member TextureRealWorldOffsetZ : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDistance".

#### Reference

Noise Class

Autodesk.Revit.DB.Visual Namespace